In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns

# display all the columns of the dataframe
pd.pandas.set_option('display.max_columns', None)

In [2]:
df = pd.read_csv('Solar_Energy_Production.csv')

In [3]:
df.head(5)

,name,id,address,date,kWh,public_url,installationDate,uid
0,Southland Leisure Centre,164440,2000 SOUTHLAND DR SW,2015/09/01 02:30:00 PM,27.805,https://monitoring.solaredge.com/solaredge-web...,2015/09/01,1644402015-09-01 14:30:00
1,Southland Leisure Centre,164440,2000 SOUTHLAND DR SW,2015/09/01 03:30:00 PM,30.559,https://monitoring.solaredge.com/solaredge-web...,2015/09/01,1644402015-09-01 15:30:00
2,Southland Leisure Centre,164440,2000 SOUTHLAND DR SW,2015/09/01 04:30:00 PM,23.613,https://monitoring.solaredge.com/solaredge-web...,2015/09/01,1644402015-09-01 16:30:00
3,Southland Leisure Centre,164440,2000 SOUTHLAND DR SW,2015/09/01 05:30:00 PM,15.257,https://monitoring.solaredge.com/solaredge-web...,2015/09/01,1644402015-09-01 17:30:00
4,Southland Leisure Centre,164440,2000 SOUTHLAND DR SW,2015/09/01 06:30:00 PM,7.896,https://monitoring.solaredge.com/solaredge-web...,2015/09/01,1644402015-09-01 18:30:00

In [4]:
df.shape # (264379, 8)

(264379, 8)

In [5]:
df.tail(5)

,name,id,address,date,kWh,public_url,installationDate,uid
264374,Telus Spark,594148,220 ST GEORGES DR NE,2018/01/03 12:00:00 PM,9.092,https://monitoringpublic.solaredge.com/solared...,2017/11/27,5941482018-01-03 12:00:00
264375,Telus Spark,594148,220 ST GEORGES DR NE,2018/01/03 01:00:00 PM,9.979,https://monitoringpublic.solaredge.com/solared...,2017/11/27,5941482018-01-03 13:00:00
264376,Telus Spark,594148,220 ST GEORGES DR NE,2018/01/03 02:00:00 PM,8.423,https://monitoringpublic.solaredge.com/solared...,2017/11/27,5941482018-01-03 14:00:00
264377,Telus Spark,594148,220 ST GEORGES DR NE,2018/01/03 03:00:00 PM,4.346,https://monitoringpublic.solaredge.com/solared...,2017/11/27,5941482018-01-03 15:00:00
264378,Telus Spark,594148,220 ST GEORGES DR NE,2018/01/03 04:00:00 PM,0.335,https://monitoringpublic.solaredge.com/solared...,2017/11/27,5941482018-01-03 16:00:00

In [6]:
df.sample(5)

,name,id,address,date,kWh,public_url,installationDate,uid
176202,Glenmore Water Treatment Plant,355827,1634 56 AV SW,2019/07/14 12:00:00 PM,131.842,https://monitoringpublic.solaredge.com/solared...,2017/01/11,3558272019-07-14 12:00:00
222880,Manchester Building M,570079,651M 25 AV SE,2019/09/01 05:00:00 PM,3.741,https://monitoringpublic.solaredge.com/solared...,2017/10/23,5700792019-09-01 17:00:00
80162,Calgary Fire Hall Headquarters,314106,1212 42 AV SE,2022/09/16 07:00:00 AM,0.124,https://monitoringpublic.solaredge.com/solared...,2016/11/07,3141062022-09-16 07:00:00
248414,Bearspaw Water Treatment Plant,577650,11444 Bearspaw Dam RD NW,2019/10/19 01:00:00 PM,477.898,https://monitoringpublic.solaredge.com/solared...,2017/10/31,5776502019-10-19 13:00:00
126513,City of Calgary North Corporate Warehouse,331901,2340 22 ST NE,2020/07/18 05:00:00 AM,0.017,https://monitoringpublic.solaredge.com/solared...,2016/12/21,3319012020-07-18 05:00:00

In [7]:
df.info() # no missing values

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 264379 entries, 0 to 264378
Data columns (total 8 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   name              264379 non-null  object
 1   id                264379 non-null  int64
 2   address           264379 non-null  object
 3   date              264379 non-null  object
 4   kWh               264379 non-null  float64
 5   public_url        264379 non-null  object
 6   installationDate  264379 non-null  object
 7   uid               264379 non-null  object
dtypes: float64(1), int64(1), object(6)
memory usage: 16.1+ MB

In [8]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
id,264379.0,372863.361840,130424.590450,164440.0,314106.000,331901.00,551172.0000,594148.000
kWh,264379.0,38.041129,71.315762,0.0,1.392,8.11,36.0675,514.462

In [9]:
df.describe(include='all').T

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
name,264379,11,Southland Leisure Centre,32218,NaN,NaN,NaN,NaN,NaN,NaN,NaN
id,264379.0,NaN,NaN,NaN,372863.36184,130424.59045,164440.0,314106.0,331901.0,551172.0,594148.0
address,264379,11,2000 SOUTHLAND DR SW,32218,NaN,NaN,NaN,NaN,NaN,NaN,NaN
date,264379,36829,2017/12/12 10:00:00 AM,11,NaN,NaN,NaN,NaN,NaN,NaN,NaN
kWh,264379.0,NaN,NaN,NaN,38.041129,71.315762,0.0,1.392,8.11,36.0675,514.462
public_url,264379,22,https://monitoringpublic.solaredge.com/solared...,25166,NaN,NaN,NaN,NaN,NaN,NaN,NaN
installationDate,264379,11,2015/09/01,32218,NaN,NaN,NaN,NaN,NaN,NaN,NaN
uid,264379,264379,1644402015-09-01 14:30:00,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [10]:
df.isnull().sum()

name                0
id                  0
address             0
date                0
kWh                 0
public_url          0
installationDate    0
uid                 0
dtype: int64

In [11]:
df[df.isnull()].count()

name                0
id                  0
address             0
date                0
kWh                 0
public_url          0
installationDate    0
uid                 0
dtype: int64

In [12]:
[features for features in df.columns]

['name',
 'id',
 'address',
 'date',
 'kWh',
 'public_url',
 'installationDate',
 'uid']

In [13]:
df.head()

,name,id,address,date,kWh,public_url,installationDate,uid
0,Southland Leisure Centre,164440,2000 SOUTHLAND DR SW,2015/09/01 02:30:00 PM,27.805,https://monitoring.solaredge.com/solaredge-web...,2015/09/01,1644402015-09-01 14:30:00
1,Southland Leisure Centre,164440,2000 SOUTHLAND DR SW,2015/09/01 03:30:00 PM,30.559,https://monitoring.solaredge.com/solaredge-web...,2015/09/01,1644402015-09-01 15:30:00
2,Southland Leisure Centre,164440,2000 SOUTHLAND DR SW,2015/09/01 04:30:00 PM,23.613,https://monitoring.solaredge.com/solaredge-web...,2015/09/01,1644402015-09-01 16:30:00
3,Southland Leisure Centre,164440,2000 SOUTHLAND DR SW,2015/09/01 05:30:00 PM,15.257,https://monitoring.solaredge.com/solaredge-web...,2015/09/01,1644402015-09-01 17:30:00
4,Southland Leisure Centre,164440,2000 SOUTHLAND DR SW,2015/09/01 06:30:00 PM,7.896,https://monitoring.solaredge.com/solaredge-web...,2015/09/01,1644402015-09-01 18:30:00

# Seperating categorical and numerical featutes

In [14]:
df['name'].unique()

array(['Southland Leisure Centre',
       'Hillhurst Sunnyside Community Association',
       'Calgary Fire Hall Headquarters', 'Whitehorn Multi-Service Centre',
       'City of Calgary North Corporate Warehouse',
       'Richmond - Knob Hill Community Hall',
       'Glenmore Water Treatment Plant', 'CFD Firehall #7',
       'Manchester Building M', 'Bearspaw Water Treatment Plant',
       'Telus Spark'], dtype=object)

In [15]:
len(df['name'].unique())

11

In [16]:
df['id'].unique()

array([164440, 308057, 314106, 319086, 331901, 332785, 355827, 551172,
       570079, 577650, 594148])

In [17]:
len(df['id'].unique())

11

In [18]:
df['installationDate'].unique()

array(['2015/09/01', '2016/09/25', '2016/11/07', '2016/12/13',
       '2016/12/21', '2016/11/21', '2017/01/11', '2017/09/13',
       '2017/10/23', '2017/10/31', '2017/11/27'], dtype=object)

In [19]:
df['installationDate'].unique()

array(['2015/09/01', '2016/09/25', '2016/11/07', '2016/12/13',
       '2016/12/21', '2016/11/21', '2017/01/11', '2017/09/13',
       '2017/10/23', '2017/10/31', '2017/11/27'], dtype=object)

In [20]:
df.groupby(['name','installationDate','id'])['kWh'].sum().sort_values(ascending =False).reset_index()

,name,installationDate,id,kWh
0,Bearspaw Water Treatment Plant,2017/10/31,577650,3137255.468
1,Whitehorn Multi-Service Centre,2016/12/13,319086,2636091.515
2,Glenmore Water Treatment Plant,2017/01/11,355827,1567049.359
3,Southland Leisure Centre,2015/09/01,164440,1173293.844
4,City of Calgary North Corporate Warehouse,2016/12/21,331901,793814.564
5,Hillhurst Sunnyside Community Association,2016/09/25,308057,191935.962
6,Manchester Building M,2017/10/23,570079,188605.876
7,CFD Firehall #7,2017/09/13,551172,176669.672
8,Calgary Fire Hall Headquarters,2016/11/07,314106,113768.440
9,Richmond - Knob Hill Community Hall,2016/11/21,332785,77456.335
10,Telus Spark,2017/11/27,594148,1334.574

In [21]:
df[df.duplicated()] # no data is duplicated

Empty DataFrame
Columns: [name, id, address, date, kWh, public_url, installationDate, uid]
Index: []

In [22]:
df.dtypes

name                 object
id                    int64
address              object
date                 object
kWh                 float64
public_url           object
installationDate     object
uid                  object
dtype: object

In [23]:
df_copy = df.copy()

In [24]:
df_copy.head()

,name,id,address,date,kWh,public_url,installationDate,uid
0,Southland Leisure Centre,164440,2000 SOUTHLAND DR SW,2015/09/01 02:30:00 PM,27.805,https://monitoring.solaredge.com/solaredge-web...,2015/09/01,1644402015-09-01 14:30:00
1,Southland Leisure Centre,164440,2000 SOUTHLAND DR SW,2015/09/01 03:30:00 PM,30.559,https://monitoring.solaredge.com/solaredge-web...,2015/09/01,1644402015-09-01 15:30:00
2,Southland Leisure Centre,164440,2000 SOUTHLAND DR SW,2015/09/01 04:30:00 PM,23.613,https://monitoring.solaredge.com/solaredge-web...,2015/09/01,1644402015-09-01 16:30:00
3,Southland Leisure Centre,164440,2000 SOUTHLAND DR SW,2015/09/01 05:30:00 PM,15.257,https://monitoring.solaredge.com/solaredge-web...,2015/09/01,1644402015-09-01 17:30:00
4,Southland Leisure Centre,164440,2000 SOUTHLAND DR SW,2015/09/01 06:30:00 PM,7.896,https://monitoring.solaredge.com/solaredge-web...,2015/09/01,1644402015-09-01 18:30:00

In [25]:
df_copy.drop(labels='public_url',axis=1,inplace=True)

In [26]:
df_copy.drop(labels=['uid','address'],axis=1,inplace=True)

In [27]:
df_copy.head(2)

,name,id,date,kWh,installationDate
0,Southland Leisure Centre,164440,2015/09/01 02:30:00 PM,27.805,2015/09/01
1,Southland Leisure Centre,164440,2015/09/01 03:30:00 PM,30.559,2015/09/01

In [28]:
df_copy['installationDate'].unique()

array(['2015/09/01', '2016/09/25', '2016/11/07', '2016/12/13',
       '2016/12/21', '2016/11/21', '2017/01/11', '2017/09/13',
       '2017/10/23', '2017/10/31', '2017/11/27'], dtype=object)

df_copy['Date'] = df_copy['day'].apply(lambda x:x.split(' ')[0])
df_copy['time'] = df_copy['day'].apply(lambda x:x.split(' ')[1])

In [29]:
df_copy2 = df_copy.copy()

In [30]:
df_copy2['year'] = pd.to_datetime(df_copy['date'],infer_datetime_format=True).dt.year
df_copy2['month'] = pd.to_datetime(df_copy['date'],infer_datetime_format=True).dt.month
df_copy2['day'] = pd.to_datetime(df_copy['date'],infer_datetime_format=True).dt.day
df_copy2['time'] = pd.to_datetime(df_copy['date'],infer_datetime_format=True).dt.time

In [31]:
df_copy2.head(2)

,name,id,date,kWh,installationDate,year,month,day,time
0,Southland Leisure Centre,164440,2015/09/01 02:30:00 PM,27.805,2015/09/01,2015,9,1,14:30:00
1,Southland Leisure Centre,164440,2015/09/01 03:30:00 PM,30.559,2015/09/01,2015,9,1,15:30:00

In [32]:
df_copy2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 264379 entries, 0 to 264378
Data columns (total 9 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   name              264379 non-null  object
 1   id                264379 non-null  int64
 2   date              264379 non-null  object
 3   kWh               264379 non-null  float64
 4   installationDate  264379 non-null  object
 5   year              264379 non-null  int64
 6   month             264379 non-null  int64
 7   day               264379 non-null  int64
 8   time              264379 non-null  object
dtypes: float64(1), int64(4), object(4)
memory usage: 18.2+ MB

In [33]:
df_copy2['time'] = df_copy2['time'].astype(str)

In [34]:
df_copy2['time_hour'] = df_copy2['time'].apply(lambda x:x.split(':')[0])
df_copy2['time_min'] = df_copy2['time'].apply(lambda x:x.split(':')[1])

In [35]:
df_copy2['time_hour']  = df_copy2['time_hour'].astype(int)
df_copy2['time_min']  = df_copy2['time_min'].astype(int)

In [36]:
df_copy2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 264379 entries, 0 to 264378
Data columns (total 11 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   name              264379 non-null  object
 1   id                264379 non-null  int64
 2   date              264379 non-null  object
 3   kWh               264379 non-null  float64
 4   installationDate  264379 non-null  object
 5   year              264379 non-null  int64
 6   month             264379 non-null  int64
 7   day               264379 non-null  int64
 8   time              264379 non-null  object
 9   time_hour         264379 non-null  int64
 10  time_min          264379 non-null  int64
dtypes: float64(1), int64(6), object(4)
memory usage: 22.2+ MB

In [37]:
df_copy2.drop(labels=['date','time'], axis=1, inplace= True)

In [38]:
df_copy2.head(2)

,name,id,kWh,installationDate,year,month,day,time_hour,time_min
0,Southland Leisure Centre,164440,27.805,2015/09/01,2015,9,1,14,30
1,Southland Leisure Centre,164440,30.559,2015/09/01,2015,9,1,15,30

In [39]:
df_copy2['installationDate'] = pd.to_datetime(df_copy2['installationDate'], infer_datetime_format=True)

In [40]:
df_copy2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 264379 entries, 0 to 264378
Data columns (total 9 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   name              264379 non-null  object
 1   id                264379 non-null  int64
 2   kWh               264379 non-null  float64
 3   installationDate  264379 non-null  datetime64[ns]
 4   year              264379 non-null  int64
 5   month             264379 non-null  int64
 6   day               264379 non-null  int64
 7   time_hour         264379 non-null  int64
 8   time_min          264379 non-null  int64
dtypes: datetime64[ns](1), float64(1), int64(6), object(1)
memory usage: 18.2+ MB

In [41]:
df_copy2.drop(labels=['id'], axis=1, inplace= True)

In [42]:
df_copy2.head(2)

,name,kWh,installationDate,year,month,day,time_hour,time_min
0,Southland Leisure Centre,27.805,2015-09-01,2015,9,1,14,30
1,Southland Leisure Centre,30.559,2015-09-01,2015,9,1,15,30

In [43]:
df_copy2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 264379 entries, 0 to 264378
Data columns (total 8 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   name              264379 non-null  object
 1   kWh               264379 non-null  float64
 2   installationDate  264379 non-null  datetime64[ns]
 3   year              264379 non-null  int64
 4   month             264379 non-null  int64
 5   day               264379 non-null  int64
 6   time_hour         264379 non-null  int64
 7   time_min          264379 non-null  int64
dtypes: datetime64[ns](1), float64(1), int64(5), object(1)
memory usage: 16.1+ MB

In [44]:
df['installationDate'].unique()

array(['2015/09/01', '2016/09/25', '2016/11/07', '2016/12/13',
       '2016/12/21', '2016/11/21', '2017/01/11', '2017/09/13',
       '2017/10/23', '2017/10/31', '2017/11/27'], dtype=object)

In [45]:
category = ['year','month','day', 'time_hour', 'time_min','installationDate']

In [46]:
for feature in df_copy2[category]:
    print(f"The unique values of '{feature}' are: \n {df_copy2[feature].unique()}\n")
    print('*'*60)

The unique values of 'year' are:
 [2015 2016 2017 2018 2019 2020 2021 2022 2023]

************************************************************
The unique values of 'month' are:
 [ 9 10 11 12  1  2  3  4  5  6  7  8]

************************************************************
The unique values of 'day' are:
 [ 1  2  3  4  5  6  7  8  9 10 11 12 13 14 15 16 17 18 21 22 23 24 25 26
 27 28 29 30 19 20 31]

************************************************************
The unique values of 'time_hour' are:
 [14 15 16 17 18 19 20 21 22 23  0  1  2  6  7  8  9 10 11 12 13  5  3  4]

************************************************************
The unique values of 'time_min' are:
 [30  0 45 15]

************************************************************
The unique values of 'installationDate' are:
 ['2015-09-01T00:00:00.000000000' '2016-09-25T00:00:00.000000000'
 '2016-11-07T00:00:00.000000000' '2016-12-13T00:00:00.000000000'
 '2016-12-21T00:00:00.000000000' '2016-11-21T00:00:00.000000000'
 '2017-01-11T00:00:00.000000000' '2017-09-13T00:00:00.000000000'
 '2017-10-23T00:00:00.000000000' '2017-10-31T00:00:00.000000000'
 '2017-11-27T00:00:00.000000000']

************************************************************

In [47]:
df_copy2.head(2)

,name,kWh,installationDate,year,month,day,time_hour,time_min
0,Southland Leisure Centre,27.805,2015-09-01,2015,9,1,14,30
1,Southland Leisure Centre,30.559,2015-09-01,2015,9,1,15,30

## kWh column moved to the end

In [48]:
df_copy2 = df_copy2[['name','installationDate','year','month','day','time_hour','time_min','kWh']]

In [49]:
df_copy2.head(2)

,name,installationDate,year,month,day,time_hour,time_min,kWh
0,Southland Leisure Centre,2015-09-01,2015,9,1,14,30,27.805
1,Southland Leisure Centre,2015-09-01,2015,9,1,15,30,30.559

# for moving column to the end
#
df.head()
column_to_move = df.pop('kWh')
df.head(2)
# len(df.columns) --> 8 columns, 7th position.

df.insert(7,'kWh', column_to_move)
df.head(2)
#

In [50]:
categorical_features = [feature for feature in df_copy2.columns if df_copy2[feature].dtype =='O']

In [51]:
categorical_features

['name']

In [52]:
numerical_features = [feature for feature in df_copy2.columns if df_copy2[feature].dtype !='O']

In [53]:
numerical_features

['installationDate', 'year', 'month', 'day', 'time_hour', 'time_min', 'kWh']

df['year'] = df['date'].apply(lambda x:x.split('/')[0])
df['month'] = df['date'].apply(lambda x:x.split('/')[1])
df['day'] = df['date'].apply(lambda x:x.split('/')[2])

In [54]:
for feature in df_copy2[categorical_features]:
    print(f"Unique values of '{feature}' are :\n {df_copy2[feature].unique()}\n\n and the lenth is {len(df_copy2[feature].unique())}")
    
    print('*'*60)

Unique values of 'name' are :
 ['Southland Leisure Centre' 'Hillhurst Sunnyside Community Association'
 'Calgary Fire Hall Headquarters' 'Whitehorn Multi-Service Centre'
 'City of Calgary North Corporate Warehouse'
 'Richmond - Knob Hill Community Hall' 'Glenmore Water Treatment Plant'
 'CFD Firehall #7' 'Manchester Building M'
 'Bearspaw Water Treatment Plant' 'Telus Spark']

 and the lenth is 11
************************************************************

In [55]:
df_copy2.head(2)

,name,installationDate,year,month,day,time_hour,time_min,kWh
0,Southland Leisure Centre,2015-09-01,2015,9,1,14,30,27.805
1,Southland Leisure Centre,2015-09-01,2015,9,1,15,30,30.559

In [56]:
df_copy2.to_csv('cleaned_solar_energy_production_calgary.csv', index=False)

df_copy2 = pd.get_dummies(df_copy2, columns=['name'], drop_first=True)

In [57]:
df_cleaned = pd.read_csv('cleaned_solar_energy_production_calgary.csv')

In [58]:
df_cleaned.head(2)

,name,installationDate,year,month,day,time_hour,time_min,kWh
0,Southland Leisure Centre,2015-09-01,2015,9,1,14,30,27.805
1,Southland Leisure Centre,2015-09-01,2015,9,1,15,30,30.559

In [59]:
df_cleaned.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 264379 entries, 0 to 264378
Data columns (total 8 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   name              264379 non-null  object
 1   installationDate  264379 non-null  object
 2   year              264379 non-null  int64
 3   month             264379 non-null  int64
 4   day               264379 non-null  int64
 5   time_hour         264379 non-null  int64
 6   time_min          264379 non-null  int64
 7   kWh               264379 non-null  float64
dtypes: float64(1), int64(5), object(2)
memory usage: 16.1+ MB

In [62]:
df_cleaned.sample(20)

,name,installationDate,year,month,day,time_hour,time_min,kWh
168779,Glenmore Water Treatment Plant,2017-01-11,2017,9,8,8,0,17.950
181687,Glenmore Water Treatment Plant,2017-01-11,2020,9,21,15,0,120.179
225524,Manchester Building M,2017-10-23,2020,5,9,14,0,12.388
195689,CFD Firehall #7,2017-09-13,2018,8,30,15,0,12.251
63808,Calgary Fire Hall Headquarters,2016-11-07,2018,12,30,14,0,0.056
198031,CFD Firehall #7,2017-09-13,2019,5,14,20,0,0.278
34679,Hillhurst Sunnyside Community Association,2016-09-25,2017,7,26,6,0,0.272
3921,Southland Leisure Centre,2015-09-01,2016,7,17,9,0,69.293
21075,Southland Leisure Centre,2015-09-01,2020,7,23,14,0,105.046
173397,Glenmore Water Treatment Plant,2017-01-11,2018,10,14,15,0,82.805
9816,Southland Leisure Centre,2015-09-01,2017,12,13,9,0,3.445
24458,Southland Leisure Centre,2015-09-01,2021,6,23,21,0,0.231
157877,Richmond - Knob Hill Community Hall,2016-11-21,2021,6,20,15,0,6.605
260913,Bearspaw Water Treatment Plant,2017-10-31,2022,7,29,12,0,267.719
108201,Whitehorn Multi-Service Centre,2016-12-13,2022,9,1,7,0,7.452
113238,City of Calgary North Corporate Warehouse,2016-12-21,2017,7,19,9,0,40.578
111402,City of Calgary North Corporate Warehouse,2016-12-21,2017,3,26,7,0,0.934
243139,Bearspaw Water Treatment Plant,2017-10-31,2018,8,19,13,0,345.602
114600,City of Calgary North Corporate Warehouse,2016-12-21,2017,10,25,17,0,2.654
205065,CFD Firehall #7,2017-09-13,2020,11,13,8,0,0.684